RAW_FILE = 'statistics (2).xlsx'
EXCLUDED_USERS_FILE = 'config/excluded_users.csv'
EXCLUDED_DOMAINS_FILE = 'config/excluded_domains.csv'
MAIN_DOMAIN = 'calc.saint-gobain.ru'
DOMAINS = {
    'calc': MAIN_DOMAIN,
    'hub': 'hub.saint-gobain.ru',
    'vetonit': 'vetonit.com',
}
USER_COL = 'Пользователь, совершивший действие'
PAGE_COL = 'Страница калькулятора'
NAME_COL = [
    'Калькулятор',
    'Действие',
    PAGE_COL,
    'IP адрес',
    'Uuid',
    'ID отслеживания',
    'Регион',
    'Город',
    USER_COL,
]
ACTION_VISIT = 'Открыта страница калькулятора'
ACTION_DOWNLOAD = 'Пользователь скачал отчет'
ACTIONS = [ACTION_VISIT, ACTION_DOWNLOAD]

TOP_N = 5
DEFAULT_MONTHS_RANGE = 6
SESSION_GAP_MINUTES = 30

FEDERAL_DISTRICTS = {
    "Центральный федеральный округ": [
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Воронежская область",
        "Ивановская область",
        "Калужская область",
        "Костромская область",
        "Курская область",
        "Липецкая область",
        "Московская область",
        "Орловская область",
        "Рязанская область",
        "Смоленская область",
        "Тамбовская область",
        "Тверская область",
        "Тульская область",
        "Ярославская область",
        "Москва"
    ],
    "Северо-Западный федеральный округ": [
        "Республика Карелия",
        "Республика Коми",
        "Архангельская область",
        "Вологодская область",
        "Калининградская область",
        "Ленинградская область",
        "Мурманская область",
        "Новгородская область",
        "Псковская область",
        "Санкт-Петербург",
        "Ненецкий автономный округ"
    ],
    "Южный федеральный округ": [
        "Республика Адыгея",
        "Республика Калмыкия",
        "Республика Крым",
        "Краснодарский край",
        "Астраханская область",
        "Волгоградская область",
        "Ростовская область",
        "Севастополь"
    ],
    "Северо-Кавказский федеральный округ": [
        "Республика Дагестан",
        "Республика Ингушетия",
        "Кабардино-Балкарская Республика",
        "Карачаево-Черкесская Республика",
        "Республика Северная Осетия — Алания",
        "Чеченская Республика",
        "Ставропольский край"
    ],
    "Приволжский федеральный округ": [
        "Республика Башкортостан",
        "Республика Марий Эл",
        "Республика Мордовия",
        "Республика Татарстан",
        "Удмуртская Республика",
        "Чувашская Республика",
        "Пермский край",
        "Кировская область",
        "Нижегородская область",
        "Оренбургская область",
        "Пензенская область",
        "Самарская область",
        "Саратовская область",
        "Ульяновская область"
    ],
    "Уральский федеральный округ": [
        "Курганская область",
        "Свердловская область",
        "Тюменская область",
        "Челябинская область",
        "Ханты-Мансийский автономный округ — Югра",
        "Ямало-Ненецкий автономный округ"
    ],
    "Сибирский федеральный округ": [
        "Республика Алтай",
        "Республика Тыва",
        "Республика Хакасия",
        "Алтайский край",
        "Красноярский край",
        "Иркутская область",
        "Кемеровская область",
        "Новосибирская область",
        "Омская область",
        "Томская область",
    ],
    "Дальневосточный федеральный округ": [
        "Республика Бурятия",
        "Республика Саха (Якутия)",
        "Забайкальский край",
        "Камчатский край",
        "Приморский край",
        "Хабаровский край",
        "Амурская область",
        "Магаданская область",
        "Сахалинская область",
        "Еврейская автономная область",
        "Чукотский автономный округ"
    ],
}


REGION_TO_DISTRICT = {
    region: district
    for district, regions in FEDERAL_DISTRICTS.items()
    for region in regions
}

NOT_SPECIFIED = 'Не указан'
NOT_IN_DICT = 'Не определён'
